// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.


// вывод номера строки с наименьшей суммой элементов 
void MinSumElements(int[,] array)
{
    int minRow = 0;
    int minSumRow = 0;
    int[,] table = new int[minRow, minSumRow];
    int sumRow = 0;
    for (int i = 0; i < table.GetLength(1); i++)
    {
        minRow += table[0, i];
    }
    for (int i = 0; i < table.GetLength(0); i++)
    {
        for (int j = 0; j < table.GetLength(1); j++) sumRow += table[i, j];
        if (sumRow < minRow)
        {
            minRow = sumRow;
            minSumRow = i;
        }
        sumRow = 0;
    }
    Console.WriteLine("Номер строки с наименьшей суммой элементов : ");
    Console.Write($"{minSumRow + 1}");
}

// вывод двумерного массива
void PrintArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}

// Генерируем элементы массива
void GenArrayRandom(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = new Random().Next(1, 10);
        }
    }
}

int[,] table = new int[4, 4];
GenArrayRandom(table);
PrintArray(table);
Console.WriteLine();
MinSumElements(table);
